Catalogs/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОблагается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиОбновления

Процедура ЗаполнитьВидыСтавокНДС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	СтавкиНДС.Ставка КАК Ставка,
	|	СтавкиНДС.НеОблагается КАК НеОблагается,
	|	СтавкиНДС.Расчетная КАК Расчетная
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		СтавкиНДСОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтавкиНДСОбъект.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ВидСтавки(Выборка);
		СтавкиНДСОбъект.ДополнительныеСвойства.Вставить("ОбновлениеВидовСтавокНДС");
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СтавкиНДСОбъект);
		Исключение
			ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ru='Ошибка заполнения вида ставки НДС'",
				УровеньЖурналаРегистрации.Ошибка,,
				СтавкиНДСОбъект.Ссылка,
				ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьСтавки_УСН2025() Экспорт
	
	ОписанияСтавок = ОписаниеСтавокНДС_УСН2025();
	
	Для Каждого Описание Из ОписанияСтавок Цикл
		
		СтавкаНДС = СтавкаНДСПоВидуСтавки(Описание.ВидСтавкиНДС);
		Если ЗначениеЗаполнено(СтавкаНДС) Тогда
			Продолжить;
		КонецЕсли;
		
		СтавкаОбъект = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СтавкаОбъект, Описание);
		СтавкаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СтавкаНДС(ВидСтавки, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ВидСтавки = Перечисления.ВидыСтавокНДС.Общая Тогда
		Возврат ОбщаяСтавкаНДС(Период);
	ИначеЕсли ВидСтавки = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
		Возврат ОбщаяСтавкаНДС(Период, Истина);
	Иначе
		Возврат СтавкаНДСПоВидуСтавки(ВидСтавки);
	КонецЕсли
	
КонецФункции

Функция СоответствиеСтавокНДС(Период = Неопределено) Экспорт
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Результат = Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыСтавокНДС.Общая, ОбщаяСтавкаНДС(Период));
	Результат.Вставить(Перечисления.ВидыСтавокНДС.ОбщаяРасчетная, ОбщаяСтавкаНДС(Период, Истина));
	
	МассивПеречислений = Новый Массив;
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.Пониженная2);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная2);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.Нулевая);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.БезНДС);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСН);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСНРасчетная);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСН);
	МассивПеречислений.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСНРасчетная);
	
	Для Каждого ВидСтавки Из  МассивПеречислений Цикл
		Результат.Вставить(ВидСтавки,СтавкаНДСПоВидуСтавки(ВидСтавки));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаСозданияВТСтавкиНДС(Период = Неопределено) Экспорт
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТСтавкиОбщая
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|	И СтавкиНДС.Ставка = &ЗначениеСтавки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	2
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|	И СтавкиНДС.Ставка <> &ЗначениеСтавки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТСтавкиОбщаяРасчетная
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|	И СтавкиНДС.Ставка = &ЗначениеСтавки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	2
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|	И СтавкиНДС.Ставка <> &ЗначениеСтавки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТСтавкиОбщая.Ссылка КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая) КАК ВидСтавкиНДС
	|ПОМЕСТИТЬ ВТСтавкиНДС
	|ИЗ
	|	ВТСтавкиОбщая КАК ВТСтавкиОбщая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТСтавкиОбщаяРасчетная.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|ИЗ
	|	ВТСтавкиОбщаяРасчетная КАК ВТСтавкиОбщаяРасчетная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная2)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная2)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная2)
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСтавкиОбщая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСтавкиОбщаяРасчетная;";
	
	Если Период >= Дата('20190101') Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеСтавки", "20");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗначениеСтавки", "18");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

// Заполняет список выбора ставок, исключая значения не характеризующие номенклатурную позицию.
//
// Параметры:
//   Форма - управляемая форма, в которой расположено поле для выбора ставки НДС
//   ИмяЭлемента - элемент формы - поле выбора ставки НДС.
//
Процедура ЗаполнитьСписокВыбораСтавокНДС(Форма, ИмяЭлемента) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы[ИмяЭлемента].РежимВыбораИзСписка = Истина;
	Элементы[ИмяЭлемента].СписокВыбора.Очистить();
	
	СоответствиеСтавок = СоответствиеСтавокНДС(ТекущаяДатаСеанса());

	ПорядокСтавок = ВидыСтавокНДСНоменклатуры();
	Для Каждого ВидСтавки Из ПорядокСтавок Цикл
		
		ПредставлениеСтавки = СоответствиеСтавок.Получить(ВидСтавки);
		Если ЗначениеЗаполнено(ПредставлениеСтавки) Тогда
			Элементы[ИмяЭлемента].СписокВыбора.Добавить(ВидСтавки, Строка(ПредставлениеСтавки));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращает массив видов ставок, доступных для установки в Номенклатуре
// 
// Возвращаемое значение:
//   - Массив из ПеречислениеСсылка.ВидыСтавокНДС
//
Функция ВидыСтавокНДСНоменклатуры() Экспорт
	
	ПорядокСтавок = Новый Массив;
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Общая);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяРасчетная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Нулевая);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.БезНДС);
	
	Возврат ПорядокСтавок;
	
КонецФункции

// Заполняет список выбора ставок, доступных организациям, применяющим УСН
//
// Параметры:
//   Форма - управляемая форма, в которой расположено поле для выбора ставки НДС
//   ИмяЭлемента - элемент формы - поле выбора ставки НДС.
//
Процедура ЗаполнитьСписокВыбораСтавокНДСНаУСН(Форма, ИмяЭлемента) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы[ИмяЭлемента].РежимВыбораИзСписка = Истина;
	Элементы[ИмяЭлемента].СписокВыбора.Очистить();
	
	ДоступныеВидыСтавок = Новый Массив;
	ДоступныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСН);
	ДоступныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСН);
	ДоступныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Общая);
	
	СоответствиеСтавок = СоответствиеСтавокНДС();

	Для Каждого Ставка Из ДоступныеВидыСтавок Цикл

		ПредставлениеСтавки = СоответствиеСтавок.Получить(Ставка);
		Если ЗначениеЗаполнено(ПредставлениеСтавки) Тогда
		   Элементы[ИмяЭлемента].СписокВыбора.Добавить(Ставка, Строка(ПредставлениеСтавки));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Справочники.СтавкиНДС.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// 10%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='10%'");
	СтавкаНДС.Ставка = 10;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Пониженная;
	
	// 18% / 118%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='18% / 118%'");
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 18;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	
	// 10% / 110%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='10% / 110%'");
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 10;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная;
	
	// 0%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='0%'");
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Нулевая;
	
	// Без НДС
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='Без НДС'");
	СтавкаНДС.НеОблагается = Истина;
	СтавкаНДС.Ставка = 0;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС;
	
	// 20% / 120%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='20% / 120%'");
	СтавкаНДС.Расчетная = Истина;
	СтавкаНДС.Ставка = 20;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	
	// 20%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='20%'");
	СтавкаНДС.Ставка = 20;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	
	// 18%
	СтавкаНДС = Элементы.Добавить();
	СтавкаНДС.Наименование = НСтр("ru='18%'");
	СтавкаНДС.Ставка = 18;
	СтавкаНДС.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
	
	СтавкиУСН2025 = ОписаниеСтавокНДС_УСН2025();
	Для Каждого Описание Из СтавкиУСН2025 Цикл
		СтавкаНДС = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(СтавкаНДС, Описание);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПериодДействия = ТекущаяДатаСеанса();
	До2019Года = ПериодДействия < '20190101';
	
	Если Параметры.Свойство("Дата") Тогда
		ПериодДействия = Макс(Параметры.Дата, ПериодДействия);
	КонецЕсли;
	Применяется176ФЗ = РегламентированнаяОтчетностьУСНКлиентСервер.Применяется176ФЗ(ПериодДействия);

	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СтавкиНДС.Ссылка КАК СтавкаНДС,
	               |	СтавкиНДС.ВидСтавкиНДС КАК ВидСтавкиНДС,
	               |	СтавкиНДС.Ставка КАК ЗначениеСтавки,
	               |	-1 КАК Порядок,
	               |	СтавкиНДС.Представление КАК Представление
	               |ИЗ
	               |	Справочник.СтавкиНДС КАК СтавкиНДС
	               |ГДЕ
	               |	НЕ СтавкиНДС.ПометкаУдаления";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	Запрос = Новый Запрос;

	Для Каждого ЭлементОтбора Из Параметры.Отбор Цикл
		ИмяПараметра = "Отбор" + ЭлементОтбора.Ключ;
		Запрос.УстановитьПараметр(ИмяПараметра, ЭлементОтбора.Значение);
		Если ТипЗнч(ЭлементОтбора.Значение) = Тип("ФиксированныйМассив") Тогда
			Условие = СтрШаблон("СтавкиНДС.%1 В (&%2)", ЭлементОтбора.Ключ, ИмяПараметра);
		Иначе
			Условие = СтрШаблон("СтавкиНДС.%1 = &%2", ЭлементОтбора.Ключ, ИмяПараметра);
		КонецЕсли; 
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(Условие);
	КонецЦикла;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ВсеСтавки = Запрос.Выполнить().Выгрузить();
	
	ПорядокСтавок = Новый Массив;
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Общая);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяРасчетная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.Нулевая);
	ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.БезНДС);
	Если Применяется176ФЗ Тогда
		ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСН);
		ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ОбщаяУСНРасчетная);
		ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСН);
		ПорядокСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяУСНРасчетная);
	КонецЕсли;
	
	Для Каждого Строка Из ВсеСтавки Цикл
		
		Порядок = ПорядокСтавок.Найти(Строка.ВидСтавкиНДС);
		Если Порядок = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая
			ИЛИ Строка.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
			
			Если Строка.ЗначениеСтавки = 18 И НЕ До2019Года
				ИЛИ Строка.ЗначениеСтавки = 20 И До2019Года Тогда
				Порядок = Порядок + ВсеСтавки.Количество();
			КонецЕсли;
			
		КонецЕсли;
		Строка.Порядок = Порядок;
	КонецЦикла;
	
	ВсеСтавки.Сортировать("Порядок");
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Строка Из ВсеСтавки Цикл
		Если Строка.Порядок >= 0 Тогда
			ДанныеВыбора.Добавить(Строка.СтавкаНДС, Строка.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтавкаНДСПоВидуСтавки(Знач ВидСтавки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = &ВидСтавкиНДС";
	Запрос.УстановитьПараметр("ВидСтавкиНДС", ВидСтавки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе   
		Если ВидСтавки = Перечисления.ВидыСтавокНДС.БезНДС Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
		КонецЕсли;
		
		Возврат Справочники.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ОбщаяСтавкаНДС(Знач Период, Расчетная = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|	И СтавкиНДС.Ставка = &ЗначениеСтавки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка,
	|	2
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|	И СтавкиНДС.Ставка <> &ЗначениеСтавки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Если Период >= Дата('20190101') Тогда
		Запрос.УстановитьПараметр("ЗначениеСтавки", 20);
	Иначе
		Запрос.УстановитьПараметр("ЗначениеСтавки", 18);
	КонецЕсли;
	Если Расчетная Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Общая", ".ОбщаяРасчетная");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ОписаниеСтавокНДС_УСН2025()

	Ставки = Новый Массив;
	Ставки.Добавить(ОписаниеСтавки(НСтр("ru='5%'"), 5, Перечисления.ВидыСтавокНДС.ПониженнаяУСН));
	Ставки.Добавить(ОписаниеСтавки(НСтр("ru='5% / 105%'"), 5, Перечисления.ВидыСтавокНДС.ПониженнаяУСНРасчетная, Истина));
	Ставки.Добавить(ОписаниеСтавки(НСтр("ru='7%'"), 7, Перечисления.ВидыСтавокНДС.ОбщаяУСН));
	Ставки.Добавить(ОписаниеСтавки(НСтр("ru='7% / 107%'"), 7, Перечисления.ВидыСтавокНДС.ОбщаяУСНРасчетная, Истина));
	
	Возврат Ставки;
	
КонецФункции

Функция ОписаниеСтавки(Наименование, Ставка, ВидСтавкиНДС, Расчетная = Ложь, НеОблагается = Ложь)
	
	Описание = Новый Структура;
	Описание.Вставить("Наименование", Наименование);
	Описание.Вставить("Ставка", Ставка);
	Описание.Вставить("ВидСтавкиНДС", ВидСтавкиНДС);
	Описание.Вставить("Расчетная", Расчетная);
	Описание.Вставить("НеОблагается", НеОблагается);
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#КонецЕсли
